# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1 

import random

n = int(input('Введите размер массива: '))

a = [] 

x = int(input('Введите число, что бы узнать, сколько раз оно повторяется в масиве: '))

count = 0

for i in range(n):
    a.append(random.randint(0, 10))
    if a[i] == x:
        count += 1

print(a)
print(count)